app/views/movements/_movement.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    <div class='d-flex align-items-center' >
      <i class="fas <%=movement.group.icon%> fs-1" data-icon="fa-check" style="width:200px, height: 100px; transform: scale(1.8); color:blue" ></i>