app/views/groups/_group.html.erb

SELECT SUM("movements"."amount") FROM "movements" WHERE "movements"."group_id" = $1  [["group_id", 6]]
---
        <h6>
          Total: <%= group.movements.sum(:amount) %>