app/controllers/groups_controller.rb

  def index
    # @groups = Group.all
    @groups = Group.all.where(user_id: current_user.id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]

  def show
    # if params[:id].to_i
    @group = Group.find(params[:id])
    # else
    @movements = @group.movements
    @total_amount = @movements.sum(:amount)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "movements".* FROM "movements" WHERE "movements"."group_id" = $1  [["group_id", 6]]
SELECT SUM("movements"."amount") FROM "movements" WHERE "movements"."group_id" = $1  [["group_id", 6]]

  def create
    @group = Group.new(group_params)
    @group.user = current_user

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdf"], ["icon", "fa-star"], ["user_id", 1], ["created_at", "2023-09-30 17:03:10.995784"], ["updated_at", "2023-09-30 17:03:10.995784"]]