app/controllers/movements_controller.rb

  def index
    @movements = Movement.all
    @group = Group.find(params[:group_id])
    @movements = @movements.where(author_id: current_user.id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "movements".* FROM "movements" WHERE "movements"."author_id" = $1  [["author_id", 1]]

  def new
    @groups = current_user.groups

    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @group = Group.find(params[:group_id])
    @movement = @group.movements.new(movement_params)
    @movement.author_id = current_user.id

    respond_to do |format|
      if @movement.save
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "movements" ("author_id", "group_id", "name", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 1], ["group_id", 6], ["name", "vvvvv"], ["amount", 50.0], ["created_at", "2023-09-30 20:39:12.504823"], ["updated_at", "2023-09-30 20:39:12.504823"]]

  def destroy
    @group = Group.find(params[:group_id])
    @movement = @group.movements.find(params[:id])


    @movement.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "movements".* FROM "movements" WHERE "movements"."group_id" = $1 AND "movements"."id" = $2 LIMIT $3  [["group_id", 6], ["id", 17], ["LIMIT", 1]]
DELETE FROM "movements" WHERE "movements"."id" = $1  [["id", 17]]

  def set_movement
    @movement = Movement.find(params[:id])
---
SELECT "movements".* FROM "movements" WHERE "movements"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]